# NumberingSchemaType Properties

---
The NumberingSchemaType type exposes the following members.
| Name| Description
---|---|---
| Guid|  The Guid of GUID-based enum object. (Inherited from GuidEnum)
Top
#### Reference
NumberingSchemaType Class
Autodesk.Revit.DB Namespace